/*Задача 19

Напишите программу, которая принимает на вход пятизначное число 
и проверяет, является ли оно палиндромом.

14212 -> нет

12821 -> да

23432 -> да
*/

Console.Clear();
Console.Write("Пожалуйста введите пятизначное число: ");
string a = Convert.ToString(Console.ReadLine()); //почему тут желтое? Моя не понимать смысл описания ощибки =(
if (a[0] == a[4] && a[1] == a[3]) Console.WriteLine($"Число {a} - палиндром");
else Console.WriteLine($"Число {a} - не палиндром");